docs/posts/2019-06-09-insurance-update.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Insurance Update</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Insurance Update</h1>
<p class="subtitle" role="doc-subtitle">Jun 09, 2019</p>
</header><p>
I feel a bit better today after a close reading of both the Aetna and the AFLAC policies. It seems that Aetna just wants to know if there are any other policies that could provide coverage. Why they want to know that now, but didn’t earlier, I have no idea.
</p>

<p>
So, I am hopeful – but I’ll know when I call tomorrow.
</p>

<p>
UPDATE: I gave the Aetna representative the number for our AFLAC policy – she confirmed that Aetna was primary and AFLAC secondary, and told me that the claims would be resubmitted. Sometimes, things go well, even when dealing with insurance.
</p>



<div class="tagline" id="org29ae488">
<p>
Tagged: <a href="../tags/misc.html">Misc</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
